from aiogram import Bot, types
from aiogram.dispatcher import Dispatcher

from aiogram.types import ReplyKeyboardMarkup, KeyboardButton, InlineKeyboardMarkup, InlineKeyboardButton
from aiogram.utils import executor

bot = Bot('5534061322:AAFHVzdUeOHb7FLrVd3MC2yhUSJ8OW5MTc0')
dp = Dispatcher(bot)


urlkb = InlineKeyboardMarkup(row_width=1)
url_btn1 = InlineKeyboardButton(text='💍Весільні зйомки\n👰‍♀️🤵', url='http://t.me/alona_weddingday_photo')
url_btn2 = InlineKeyboardButton(text='Сімейні фото👨‍👩‍👦', url='http://t.me/alona_family_photo')
url_btn3 = InlineKeyboardButton(text='ЛавСторі❤️', url='http://t.me/alona_lovestory_photo')
url_btn4 = InlineKeyboardButton(text='Персональні фототесії🔥', url='http://t.me/alona_personal_photo')
url_btn5 = InlineKeyboardButton(text='Хрещення👼🏼', url='http://t.me/alona_baby_photo')
url_btn6 = InlineKeyboardButton(text='Вінчання💒', url='http://t.me/alona_wedding')
url_btn8 = InlineKeyboardButton(text='Фотокниги🎞', url='http://t.me/alona_photobooks')
url_btn9 = InlineKeyboardButton(text='Дитячі Фото🐣', url='https://t.me/alona_children_photo')


urlkb2 = InlineKeyboardMarkup(row_width=1)
url_instagram = InlineKeyboardButton(text='Написати', url='https://instagram.com/alonka_sydorenko?igshid=YmMyMTA2M2Y=')

urlkb2.add(url_instagram)
urlkb.add(url_btn1, url_btn2, url_btn9, url_btn5, url_btn6, url_btn3, url_btn4, url_btn8)

''' =========================================================================================================='''

price_btn = KeyboardButton('💵 📸 💶\nПРАЙС НА ЗЙОМКИ')
portfolios_btn = KeyboardButton('📘 📗 📕\nПОРТФОЛІО')

wedding_btn = KeyboardButton('💍Весільна зйомка👰‍♀️🤵')
family_btn = KeyboardButton('👨‍👩‍👦\nСімейна')
personal_btn = KeyboardButton('🔥\nПерсональна')
love_btn = KeyboardButton('❤️\nЛавСторі')
church_btn = KeyboardButton('👼🏼\nХрещення')
vinchannia_btn = KeyboardButton('💒\nВінчання')
birthday_btn = KeyboardButton('🎂День Народження')
book_btn = KeyboardButton('🎞\nФотокниги')


book_1515 = KeyboardButton('[15 x 15]')
book_2020 = KeyboardButton('[20 x 20]')
book_2030 = KeyboardButton('[20 x 30]')
book_2525 = KeyboardButton('[25 x 25]')
book_3030 = KeyboardButton('[30 x 30]')
book_3045 = KeyboardButton('[30 x 45]')
electro_btn = KeyboardButton('📱\nЦифровий альбом')


want_btn = KeyboardButton('Хочу!😍')


back_btn = KeyboardButton('↩️Назад')
back_manu_btn = KeyboardButton('↩️Назад до меню')

full_price_btn = ReplyKeyboardMarkup().add(wedding_btn,
                                                     family_btn, personal_btn,
                                                      love_btn, church_btn, vinchannia_btn,
                                                      birthday_btn,book_btn, back_btn)
main_menu_btn = ReplyKeyboardMarkup().add(price_btn, portfolios_btn)
want_photo_btn = ReplyKeyboardMarkup(resize_keyboard=True).add(want_btn, back_manu_btn)
book_price_btn = ReplyKeyboardMarkup().add(book_1515, book_2020, book_2030, book_2525, book_3030, book_3045, electro_btn, back_manu_btn )

'''========================================================================================================================'''

@dp.message_handler(commands=['start'])
async def command_start(message : types.Message):
    await bot.send_message(message.from_user.id, 'Привіт!🤗 Хочеш дивитись прайс чи переглянути портфоліо?😋', reply_markup=main_menu_btn)


@dp.message_handler()
async def bot_message(message : types.Message):
    if message.text == '💵 📸 💶\nПРАЙС НА ЗЙОМКИ':
        await bot.send_message(message.from_user.id, 'Обери те, що тебе цікавить😉', reply_markup=full_price_btn)

    elif message.text == '↩️Назад':
        await bot.send_message(message.from_user.id, 'Хочеш дивитись прайс чи, переглянути портфоліо?😋', reply_markup=main_menu_btn)

    elif message.text == 'Хочу!😍':
        await bot.send_message(message.from_user.id,
            '''Подзвони мені і замов😋
                    ⬇️
            0935289756

    Напиши у Telegram📩
                    ⬇️
      @alonka_sydorenko

    Напиши у Instagram📩
                    ⬇️
        ''', reply_markup=urlkb2)

    elif message.text == '↩️Назад до меню':
        await bot.send_message(message.from_user.id, 'Обери послугу, яка тебе цікавить😊', reply_markup=full_price_btn)


    elif message.text == '📘 📗 📕\nПОРТФОЛІО':
        await message.answer('Яку категорію фото будемо дивитись?🤓', reply_markup=urlkb)


    elif message.text == '🎞\nФотокниги':
        await bot.send_message(message.from_user.id, 'Обери розмір✂️', reply_markup=book_price_btn)



    elif message.text == '💍Весільна зйомка👰‍♀️🤵':
        await bot.send_message(message.from_user.id,
         '''.
                  Весільна зйомка Пакет 1
                              3️⃣5️⃣0️⃣$
        ✓ Зйомка з 9:00 до 18:00
        ✓ До 600-700  оброблених фото 
        ✓ Весь матеріал на флешці
        ✓ Друк фото  до 50шт (10х15 ) або друк прінтбука 40ст.
        ✓ Віддача в брендовій коробочці


                  Весільна зйомка Пакет 2
                              5️⃣0️⃣0️⃣$
         ✓ Зйомка цілого дня з 9:00 до 23:00,
         ✓ Від 900 оброблених фото
         ✓ Весь матеріал на флешці
          ✓ Фотокнига 20х20
         ✓ Друк фотографій до 50 шт

                            ------------

         ✓ Є можливість додатково замовити фотокнигу або холст!  
        ❗️ Ваша дата бронюється тільки після внесення завдатку! 
        Повна Оплата в день весілля.
        Завдаток не повертається! ❗️

        Термін віддачі: 2-3 місяці(в залежності від зайнятості)''', reply_markup=want_photo_btn)

    elif message.text == '🔥\nПерсональна':
        await bot.send_message(message.from_user.id,
            '''.
                     Ціна зйомки на 2023
                                     ⬇️
        ✓ Персональна- 1500 грн/год (від 100 оброблених фото)
        ✓ Оренда студії 1 год: 800 грн/год (якщо потрібно)
        ✓ Додатково можна замовити друк фотокниг , холстів , друк фото та подарункові сертифікати ☝️які діють 2 місяці з дня подарунку
        ✓ Якщо Вам потрібно мати фото до якоїсь конкретної дати - повідомляйте завчасно!
        ✓ Фото віддаються на файлообмінник, але якщо Вам так не зручно, то можна перекинути на Вашу флешку

                            -----------

        ✓ Термін віддачі - до 2 тижнів
        ✓ ❗️Термін віддачі фотографій залежить від зайнятості  і може інколи відрізнятись від заданого терміну(уточнюйте)❗️ ''', reply_markup=want_photo_btn)

    elif message.text == '👨‍👩‍👦\nСімейна':
        await bot.send_message(message.from_user.id,
            '''.
                     Ціна зйомки на 2023
                                     ⬇️
        ✓ Сімейна- 1500 грн/год (від 100 оброблених фото)
        ✓ Оренда студії 1 год: 800 грн/год (якщо потрібно)
        ✓ Додатково можна замовити друк фотокниг , холстів , друк фото та подарункові сертифікати ☝️які діють 2 місяці з дня подарунку
        ✓ Якщо Вам потрібно мати фото до якоїсь конкретної дати - повідомляйте завчасно!
        ✓ Фото віддаються на файлообмінник, але якщо Вам так не зручно, то можна перекинути на Вашу флешку

                            -----------

        ✓ Термін віддачі - до 2 тижнів
        ✓ ❗️Термін віддачі фотографій залежить від зайнятості  і може інколи відрізнятись від заданого терміну(уточнюйте)❗️ ''', reply_markup=want_photo_btn)

    elif message.text == '❤️\nЛавСторі':
        await bot.send_message(message.from_user.id,
            '''.
                     Ціна зйомки на 2023
                                     ⬇️
        ✓ ЛавСторі- 1500 грн/год (від 100 оброблених фото)
        ✓ Оренда студії 1 год: 800 грн/год (якщо потрібно)
        ✓ Додатково можна замовити друк фотокниг , холстів , друк фото та подарункові сертифікати ☝️які діють 2 місяці з дня подарунку
        ✓ Якщо Вам потрібно мати фото до якоїсь конкретної дати - повідомляйте завчасно!
        ✓ Фото віддаються на файлообмінник, але якщо Вам так не зручно, то можна перекинути на Вашу флешку

                            -----------

        ✓ Термін віддачі - до 2 тижнів
        ✓ ❗️Термін віддачі фотографій залежить від зайнятості  і може інколи відрізнятись від заданого терміну(уточнюйте)❗️ ''', reply_markup=want_photo_btn)

    elif message.text == '👼🏼\nХрещення':
        await bot.send_message(message.from_user.id,
            '''.
                     Ціна зйомки на 2023
                                     ⬇️
        ✓ Хрещення - 1500 грн/год
        ✓ Додатково можна замовити друк фотокниг , холстів , друк фото та подарункові сертифікати ☝️які діють 2 місяці з дня подарунку
        ✓ Якщо Вам потрібно мати фото до якоїсь конкретної дати - повідомляйте завчасно!
        ✓ Фото віддаються на файлообмінник, але якщо Вам так не зручно, то можна перекинути на Вашу флешку

                            -----------

        ✓ Термін віддачі - до 2 тижнів
        ✓ ❗️Термін віддачі фотографій залежить від зайнятості  і може інколи відрізнятись від заданого терміну(уточнюйте)❗️ ''', reply_markup=want_photo_btn)

    elif message.text == '💒\nВінчання':
        await bot.send_message(message.from_user.id,
            '''.
                     Ціна зйомки на 2023
                                     ⬇️
        ✓ Вінчання - 1500 грн/год
        ✓ Додатково можна замовити друк фотокниг , холстів , друк фото та подарункові сертифікати ☝️які діють 2 місяці з дня подарунку
        ✓ Якщо Вам потрібно мати фото до якоїсь конкретної дати - повідомляйте завчасно!
        ✓ Фото віддаються на файлообмінник, але якщо Вам так не зручно, то можна перекинути на Вашу флешку

                            -----------

        ✓ Термін віддачі - до 2 тижнів
        ✓ ❗️Термін віддачі фотографій залежить від зайнятості  і може інколи відрізнятись від заданого терміну(уточнюйте)❗️ ''', reply_markup=want_photo_btn)

    elif message.text == '🎂День Народження':
        await bot.send_message(message.from_user.id,
            '''.
                     Ціна зйомки на 2023
                                     ⬇️
        ✓ День Народження- 1500 грн/год
        ✓ Оренда студії 1 год: 800 грн/год (якщо потрібно)
        ✓ Додатково можна замовити друк фотокниг , холстів , друк фото та подарункові сертифікати ☝️які діють 2 місяці з дня подарунку
        ✓ Якщо Вам потрібно мати фото до якоїсь конкретної дати - повідомляйте завчасно!
        ✓ Фото віддаються на файлообмінник, але якщо Вам так не зручно, то можна перекинути на Вашу флешку

                            -----------

        ✓ Термін віддачі - до 2 тижнів
        ✓ ❗️Термін віддачі фотографій залежить від зайнятості  і може інколи відрізнятись від заданого терміну(уточнюйте)❗️ ''', reply_markup=want_photo_btn)

    elif message.text == '[15 x 15]':
        await bot.send_message(message.from_user.id,
            '''10 розворотів - 1️⃣2️⃣0️⃣0️⃣ грн

12 розворотів - 1️⃣4️⃣0️⃣0️⃣ грн 

15 розворотів - 1️⃣6️⃣0️⃣0️⃣ грн

18 розворотів - 1️⃣7️⃣0️⃣0️⃣ грн

20 розворотів - 1️⃣8️⃣0️⃣0️⃣ грн

25 розворотів - 1️⃣9️⃣0️⃣0️⃣ грн

================================

Папір: 
🔗Люстр (як звичайне фото, має незначний рівень глянцю)
🔗Шовк (фактурна поверхня, яка нагадує за структурою найтоншу шовкову тканину) 

Обкладинка: 
🔗Тканина 
🔗Шкірзамінник
🔗Натуральна шкіра
🔗Велюр


Тип вставки: 
🔗Тиснення 
🔗Металева вставка
🔗Фото вставка 
🔗Фольга''')

    elif message.text == '[20 x 20]':
        await bot.send_message(message.from_user.id,
            '''10 розворотів - 1️⃣9️⃣0️⃣0️⃣ грн

12 розворотів - 2️⃣0️⃣0️⃣0️⃣ грн

15 розворотів - 2️⃣1️⃣0️⃣0️⃣ грн

18 розворотів - 2️⃣2️⃣0️⃣0️⃣ грн

20 розворотів - 2️⃣3️⃣0️⃣0️⃣ грн

25 розворотів - 2️⃣4️⃣0️⃣0️⃣ грн

================================

Папір: 
🔗Люстр (як звичайне фото, має незначний рівень глянцю)
🔗Шовк (фактурна поверхня, яка нагадує за структурою найтоншу шовкову тканину) 

Обкладинка: 
🔗Тканина 
🔗Шкірзамінник
🔗Натуральна шкіра
🔗Велюр


Тип вставки: 
🔗Тиснення 
🔗Металева вставка
🔗Фото вставка 
🔗Фольга''')

    elif message.text == '[20 x 30]':
        await bot.send_message(message.from_user.id,
            '''10 розворотів - 2️⃣1️⃣0️⃣0️⃣ грн

12 розворотів - 2️⃣2️⃣0️⃣0️⃣ грн

15 розворотів - 2️⃣4️⃣0️⃣0️⃣ грн

18 розворотів - 2️⃣7️⃣0️⃣0️⃣ грн

20 розворотів - 2️⃣8️⃣0️⃣0️⃣ грн

25 розворотів - 3️⃣1️⃣0️⃣0️⃣ грн

================================

Папір: 
🔗Люстр (як звичайне фото, має незначний рівень глянцю)
🔗Шовк (фактурна поверхня, яка нагадує за структурою найтоншу шовкову тканину) 

Обкладинка: 
🔗Тканина 
🔗Шкірзамінник
🔗Натуральна шкіра
🔗Велюр


Тип вставки: 
🔗Тиснення 
🔗Металева вставка
🔗Фото вставка 
🔗Фольга''')

    elif message.text == '[25 x 25]':
        await bot.send_message(message.from_user.id,
            '''10 розворотів - 2️⃣1️⃣0️⃣0️⃣ грн

12 розворотів - 2️⃣2️⃣0️⃣0️⃣ грн

15 розворотів - 2️⃣5️⃣0️⃣0️⃣ грн

18 розворотів - 2️⃣8️⃣0️⃣0️⃣ грн

20 розворотів - 3️⃣0️⃣0️⃣0️⃣ грн

25 розворотів - 3️⃣3️⃣0️⃣0️⃣ грн

================================

Папір: 
🔗Люстр (як звичайне фото, має незначний рівень глянцю)
🔗Шовк (фактурна поверхня, яка нагадує за структурою найтоншу шовкову тканину) 

Обкладинка: 
🔗Тканина 
🔗Шкірзамінник
🔗Натуральна шкіра
🔗Велюр


Тип вставки: 
🔗Тиснення 
🔗Металева вставка
🔗Фото вставка 
🔗Фольга''')

    elif message.text == '[30 x 30]':
        await bot.send_message(message.from_user.id,
            '''10 розворотів - 2️⃣4️⃣0️⃣0️⃣ грн

12 розворотів - 2️⃣6️⃣0️⃣0️⃣ грн 

15 розворотів - 2️⃣9️⃣0️⃣0️⃣ грн

18 розворотів - 3️⃣1️⃣0️⃣0️⃣ грн

20 розворотів - 3️⃣4️⃣0️⃣0️⃣ грн

25 розворотів - 3️⃣7️⃣0️⃣0️⃣ грн

================================

Папір: 
🔗Люстр (як звичайне фото, має незначний рівень глянцю)
🔗Шовк (фактурна поверхня, яка нагадує за структурою найтоншу шовкову тканину) 

Обкладинка: 
🔗Тканина 
🔗Шкірзамінник
🔗Натуральна шкіра
🔗Велюр


Тип вставки: 
🔗Тиснення 
🔗Металева вставка
🔗Фото вставка 
🔗Фольга''')

    elif message.text == '[30 x 45]':
        await bot.send_message(message.from_user.id,
            '''10 розворотів - 2️⃣9️⃣0️⃣0️⃣  грн

12 розворотів - 3️⃣2️⃣0️⃣0️⃣ грн 

15 розворотів - 3️⃣4️⃣0️⃣0️⃣ грн

18 розворотів - 3️⃣7️⃣0️⃣0️⃣ грн

20 розворотів - 3️⃣9️⃣0️⃣0️⃣ грн

25 розворотів - 4️⃣6️⃣0️⃣0️⃣ грн

================================

Папір: 
🔗Люстр (як звичайне фото, має незначний рівень глянцю)
🔗Шовк (фактурна поверхня, яка нагадує за структурою найтоншу шовкову тканину) 

Обкладинка: 
🔗Тканина 
🔗Шкірзамінник
🔗Натуральна шкіра
🔗Велюр


Тип вставки: 
🔗Тиснення 
🔗Металева вставка
🔗Фото вставка 
🔗Фольга''')

    elif message.text == '📱\nЦифровий альбом':
        await bot.send_message(message.from_user.id,
            '''[15х15] 1️⃣0️⃣0️⃣0️⃣ грн

[15х21] 1️⃣1️⃣0️⃣0️⃣ грн

[20х20] 1️⃣4️⃣0️⃣0️⃣ грн

[20х30] 1️⃣5️⃣0️⃣0️⃣ грн

[30х20] 1️⃣6️⃣0️⃣0️⃣ грн

[30х30] 1️⃣7️⃣0️⃣0️⃣ грн

[30х40] 1️⃣8️⃣0️⃣0️⃣ грн

[40х30] 1️⃣9️⃣0️⃣0️⃣ грн

================================

Цифровий альбом вміщує у себе більше фотографій,
має тверду обкладинку, всередині ніби гортаєте журнал.

Іде стандартно від 40 сторінок''')

    else:
        await bot.send_message(message.from_user.id, 'Не займайся творчістю, натисни на кнопку😁')

if __name__ == '__main__':
    executor.start_polling(dp)

